Repository: liyishibeck-ctrl/Buddhist_Text_Analysis_Platform
Catalog: data/raw/tibetan/84000/data-translation-memory-master/toh1-6-v3.tmx
Source language: bo
Languages: en

source: དེ་ནས་བཅོམ་ལྡན་འདས་ཀྱིས་ཚེ་དང་ལྡན་པ་ཀུན་དགའ་བོ་ལ་བཀའ་སྩལ་པ། ཀུན་དགའ་བོ་ཕྱོགས་འདིར་རྒྱལ་པོ་མང་པོས་བཀུར་བའི་རྟ་བཟང་པོ་རིན་པོ་ཆེ་བྱུང་སྟེ། དེའི་ཕྱིར་འདི་རྟ་བཟངས་ཞེས་བྱ་བར་གྲགས་སོ།
en: There the Blessed One said to the venerable Ānanda, “Ānanda, in this place appeared King Mahāsammata’s good, precious horse. Therefore this place was named Bhadrāśva (good horse).” III. Mathurā A. The Prediction about Upagupta

source: །དེ་ནས་བཅོམ་ལྡན་འདས་ཀྱིས་ཚེ་དང་ལྡན་པ་ཀུན་དགའ་བོ་ལ་བཀའ་སྩལ་པ། ཀུན་དགའ་བོ་བཅོམ་བརླག་གང་ན་བ་དེར་འདོང་ངོ་།
en: Thereupon the Blessed One said to the venerable Ānanda, “Ānanda, let us go to Mathurā.”

source: །བཙུན་པ་བཀའ་བཞིན་འཚལ་ཞེས་ཚེ་དང་ལྡན་པ་ཀུན་དགའ་བོས་བཅོམ་ལྡན་འདས་ཀྱི་ལྟར་མཉན་ཏེ།
en: “Certainly, O Honored One,” replied the venerable Ānanda to the Blessed One.

source: དེ་ནས་བཅོམ་ལྡན་འདས་བཅོམ་བརླག་ཏུ་གཤེགས་པ་དང་། བཅོམ་ལྡན་འདས་ཀྱིས་རྒྱང་རིང་པོ་ཁོ་ན་ཞིག་ན་ཚལ་སྔོ་ཞིང་སྔོ་བ་བསྒྲེངས་པ་དག་གཟིགས་སོ།
en: Then the Blessed One went to Mathurā, where he saw a green forest rising in the distance.

source: །གཟིགས་ནས་ཀྱང་ཚེ་དང་ལྡན་པ་ཀུན་དགའ་བོ་ལ་བཀའ་སྩལ་པ། ཀུན་དགའ་བོ་ཁྱོད་ཀྱིས་ཚལ་སྔོ་ཞིང་སྔོ་བ་བསྒྲེངས་པ་ཕ་བི་མཐོང་ངམ།
en: At the sight of it, he said to the venerable Ānanda, “Ānanda, do you see the green forest rising?”

source: །ཀུན་དགའ་བོ་དེ་ནི་རི་བོ་རྩེ་མཐོན་ཞེས་བྱ་སྟེ། ང་ཡོངས་སུ་མྱ་ངན་ལས་འདས་ནས་ལོ་བརྒྱ་ལོན་པ་དང་། བཅོམ་བརླག་ནས་གར་མཁན་དང་དཔའ་བོ་ཞེས་བྱ་བ་སྤུན་གཉིས་ཀྱིས་དེ་ལ་གཙུག་ལག་ཁང་རྩིག་པར་འགྱུར་ཏེ།
en: “That is a mountain called Urumuṇḍa. When a hundred years have passed after I am completely emancipated, two brothers in Mathurā named Naṭa and Bhaṭa will build a monastery there.

source: དེའི་མིང་གར་མཁན་དཔའ་བོ་ཞེས་བྱ་བར་འགྱུར་ཞིང་ལྷག་མཐོང་དང་ཞི་གནས་ཀྱི་རྗེས་སུ་མཐུན་པའི་གནས་མལ་རྣམས་ཀྱི་མཆོག་ཏུ་འགྱུར་རོ།
en: Its name will therefore be Naṭabhaṭika, and it will become the best of the dwelling places that are suited to insight and tranquility.

source: །ཀུན་དགའ་བོ་བཅོམ་བརླག་འདིར་སྤོས་འཚོང་གི་ཁྱེའུ་སྦས་པ་ཞེས་བྱ་བ་འབྱུང་བར་འགྱུར་ཏེ།
en: “Ānanda, in this Mathurā there will be a son of a perfumer named Gupta.

source: དེའི་བུ་ཉེ་སྦས་ཞེས་བྱ་བ་སངས་རྒྱས་ཀྱི་མཚན་མེད་པ་ཞིག་འབྱུང་བ་དེ་ང་ཡོངས་སུ་མྱ་ངན་ལས་འདས་ནས་ལོ་བརྒྱ་ལོན་པ་དང་བསྟན་པ་ལ་རབ་ཏུ་བྱུང་ནས་སངས་རྒྱས་ཀྱི་བྱ་བ་བྱེད་པར་འགྱུར་རོ།
en: His son, Upagupta, will be a buddha without the marks. When a hundred years have passed after I am completely emancipated, he will perform the acts of a buddha, having gone forth in the teachings.

source: །དགེ་སློང་ཀུན་དགའ་བོའི་ལྷན་ཅིག་གནས་པ་ཉི་མའི་གུང་ཞེས་བྱ་བས་ཉེ་སྦས་དེ་རབ་ཏུ་འབྱིན་པར་འགྱུར་ཏེ། གདམས་ངག་སྟོན་པ་རྣམས་ཀྱི་ཕྱི་མ་ནི་ཉེ་སྦས་ཡིན་པར་འགྱུར་རོ།
en: The monk Ānanda’s co-residential pupil named Madhyandina will let Upagupta go forth. The last of the instructors will be Upagupta.

source: །གར་མཁན་དཔའ་བོ་དེ་ལ་ཕུག་སྲིད་དུ་ཁྲུ་བཅྭ་བརྒྱད་པ། ཞེང་དུ་ཁྲུ་བཅུ་གཉིས་པ། འཕང་དུ་ཁྲུ་བདུན་པ་ཞིག་ཡོད་པར་འགྱུར་ཏེ།
en: There will be a cave that is eighteen cubits long, twelve cubits wide, and seven cubits high near that Naṭabhaṭika.

source: དེས་གང་དང་གང་དག་ལ་གདམས་ངག་བསྟན་ནས་དགྲ་བཅོམ་པ་མངོན་སུམ་དུ་བྱས་པ་དེ་དང་དེ་རྣམས་ཀྱིས་ཐུར་མ་སོར་བཞི་ཙམ་པ་རེ་རེ་ཕུག་དེའི་ནང་དུ་འདོར་བར་འགྱུར་རོ།
en: Each of those who have been instructed by him to actualize the fruit of an arhat will throw a stick of four fingers’ breadth into the cave.

source: །གང་གི་ཚེ་ཕུག་དེ་དགྲ་བཅོམ་པའི་ཐུར་མས་གང་བར་གྱུར་པ་དེའི་ཚེ་ཉེ་སྦས་ཡོངས་སུ་མྱ་ངན་ལས་འདའ་བར་འགྱུར་ཏེ།
en: When the cave has become full of the sticks of those arhats, Upagupta will be completely emancipated.

source: དེ་ཡོངས་སུ་མྱ་ངན་ལས་འདས་ནས་དགྲ་བཅོམ་པའི་ཐུར་མ་དེ་དག་ཉིད་སྤུངས་ནས་དེ་རྣམས་ཀྱིས་སྲེག་པར་བྱེད་དོ།
en: After he has been completely emancipated, they will pile up the arhats’ sticks and cremate his body.” B. The Former Life of Upagupta

source: །དགེ་སློང་རྣམས་ཐེ་ཙོམ་སྐྱེས་ནས་ཐེ་ཙོམ་ཐམས་ཅད་གཅོད་པ་སངས་རྒྱས་བཅོམ་ལྡན་འདས་ལ་ཞུས་པ། བཙུན་པ་བཅོམ་ལྡན་འདས་ཀྱིས་མ་འོངས་པ་ན་སྐྱེ་བོ་མང་པོ་ལ་སྙིང་བརྩེ་བ་དང་ཚེ་དང་ལྡན་པ་ཉེ་སྦས་ལུང་བསྟན་པ་ལ་གཟིགས།
en: The monks, feeling doubtful, inquired of the Buddha, the Blessed One, the one who severs all doubts, “How is it, O Honored One, that the Blessed One has predicted the venerable Upagupta’s having compassion for many people in the future?”

source: བཅོམ་ལྡན་འདས་ཀྱིས་བཀའ་སྩལ་པ། དགེ་སློང་དག་དེའི་ཚེར་མ་ཟད་ཇི་ལྟར་འདི་འདས་པའི་དུས་ན་སྐྱེ་བོ་མང་པོ་ལ་ཕན་པའི་ཕྱིར་ཞུགས་པ་དེ་ལེགས་པར་རབ་ཏུ་ཉོན་ལ་ཡིད་ལ་ཟུང་ཤིག་དང་བཤད་དོ།
en: “Listen, monks,” said the Blessed One, “and inscribe it in your minds how, not only in that time, but also previously, he acted for the benefit of many people. I will tell you about it.

source: །དགེ་སློང་དག་སྔོན་བྱུང་བ་རི་བོ་རྩེ་མཐོན་འདི་ཉིད་ཀྱི་ངོས་གསུམ་ལ་རང་སངས་རྒྱས་དང་དྲང་སྲོང་དང་། སྤྲེའུ་རྣམས་གནས་ཏེ།
en: “In a time long ago, monks, there lived self-awakened ones, ṛṣis, and monkeys on the three sides of this Mount Urumuṇḍa.

source: ངོས་གཅིག་ན་ནི་རང་སངས་རྒྱས་ལྔ་བརྒྱའོ། །གཉིས་པ་ལ་ནི་དྲང་སྲོང་ལྔ་བརྒྱའོ། །གསུམ་པ་ལ་ནི་སྤྲེའུ་ལྔ་བརྒྱའོ།
en: On one side lived five hundred self-awakened ones, on the second five hundred ṛṣis, and on the third five hundred monkeys.

source: །སྤྲེའུའི་སྡེ་དཔོན་གྱི་ཀུན་དུ་སྤྱོད་པ་ནི་སྤྲེའུའི་ཕྲུ་གུ་བཙས་ཤིང་བཙས་པ་དག་གསོད་པར་བྱེད་པ་ཡིན་ནོ།
en: Whenever a child of a monkey was born, the leader of the monkeys used to kill it.

source: །དེ་ནས་སྤྲ་མོ་དེ་དག་ཕྲུ་གུའི་མྱ་ངན་གྱིས་ནོན་པས་ཕན་ཚུན་གྲོས་བྱ་བར་བརྩམས་པ།
en: Therefore, the female monkeys, out of sorrow for their children, began to discuss this among themselves: ‘Listen, ladies.

source: ཤེས་ལྡན་སྤྲ་མོ་དག་ཉོན་ཅིག །བདག་ཅག་གི་ཕྲུ་གུ་བཙས་ཤིང་བཙས་པ་དག་སྡེ་དཔོན་འདིས་གསོད་པར་བྱེད་ཀྱིས་དེ་ལ་ཐབས་ཤིག་བཤམ་པར་བྱ་སྟེ། བདག་ཅག་ལས་སྤྲ་མོ་གང་ཞིག་སྦྲུམ་པར་གྱུར་ན་དེས་སྡེ་དཔོན་ལ་བརྗོད་པར་མི་བྱའོ།
en: Since every time a child is born to us, it is killed by this leader, we must devise a plan regarding this—when any one of us female monkeys has become pregnant, she should not tell the leader.’

source: །ཇི་ཙམ་དུས་གཞན་ཞིག་ན་སྤྲ་མོ་ཞིག་སྦྲུམ་པར་གྱུར་ནས་དེ་དེ་རྣམས་ཀྱིས་དབེན་པའི་ཕྱོགས་ཤིག་ཏུ་སྦས་ནས་རྩ་བ་དང་འབྲས་བུས་བསྙོད་དེ་སྤྲེའུའི་ཕྲུ་གུ་བྱུང་ནས་དེ་ཡང་དེ་རྣམས་ཀྱིས་དབེན་པའི་ཕྱོགས་ཤིག་ཏུ་བསྣུན་གསོས་བསྐྱེད་དེ།
en: “Later, when a female monkey became pregnant, they concealed her in a hidden place and fed her with roots and fruits. After the baby monkey was born, they also nourished and raised him in that hidden place.

source: དེ་གང་གི་ཚེ་ཆེན་པོར་གྱུར་པ་དེའི་ཚེ་དེས་སྡེ་དཔོན་དེ་རང་གི་ཁྱུ་ནས་བསྐྲད་ནས་རི་བོ་རྩེ་མཐོན་ན་ཕན་ཚུན་དུ་འཁྱམ་པར་བརྩམས་སོ།
en: That monkey then grew up and banished the leader from his own troop. The leader began to wander around on Mount Urumuṇḍa.

source: །དེ་འཁྱམ་པ་ན་རང་སངས་རྒྱས་རྣམས་ཀྱི་སྒྲ་ཐོས་ནས་དེ་དེ་རྣམས་ཀྱི་དྲུང་དུ་སོང་སྟེ།
en: As he wandered he heard the voices of the self-awakened ones and approached them.

source: གང་གི་ཚེ་བག་ཕེབས་པར་གནས་པར་གྱུར་པ་དེའི་ཚེ་དེ་རྣམས་ལ་རྩ་བ་དང་། ལོ་མ་དང་མེ་ཏོག་དང་འབྲས་བུ་དང་སོ་ཤིང་དག་འབུལ་བར་བྱེད་དོ།
en: When he felt comfortable living with them, he offered them roots, leaves, flowers, fruits, and toothpicks.

source: །དེ་རྣམས་ཀྱིས་ཀྱང་དེ་ལ་ལྷུང་བཟེད་ཀྱི་ལྷག་མ་དག་འདོར་བར་བྱེད་དོ།
en: They, too, gave him leftovers from their bowls.

source: །རང་སངས་རྒྱས་དེ་རྣམས་ཀྱི་ཀུན་དུ་སྤྱོད་པ་ནི་ཟོས་ཤིང་ཟོས་ནས་སྐྱིལ་མོ་ཀྲུང་བཅས་ཏེ་འདུག་གོ།
en: Whenever the self-awakened ones had finished their meal, they used to sit with their legs crossed.

source: །སྤྲེའུ་དེས་ཀྱང་དེ་རྣམས་ཀྱི་སྤྱོད་ལམ་མཐོང་ནས་སྐྱིལ་མོ་ཀྲུང་བཅས་ཤིང་འདུག་གོ།
en: Observing their behavior, the monkey, too, sat with his legs crossed.

source: །ཇི་ཙམ་དུས་གཞན་ཞིག་ན་རང་སངས་རྒྱས་དེ་རྣམས་འདི་སྙམ་དུ་སེམས་ཏེ། བདག་ཅག་གི་ལུས་རྣག་ཅན་འདིས་ཐོབ་པར་བྱ་བ་གང་ཡིན་པ་ནི་ཐོབ་ཟིན་གྱིས། བདག་ཅག་ཞི་བ་མྱ་ངན་ལས་འདས་པའི་དབྱིངས་སུ་འཇུག་གོ་སྙམ་ནས། དེ་ནས་དེ་རྣམས་ཀྱིས་འབར་བ་དང་། གསལ་བ་དང་། ཆར་འབེབས་པ་དང་། གློག་འབྱིན་པའི་ཆོ་འཕྲུལ་དག་བྱས་ནས་ཕུང་པོ་ལྷག་མ་མེད་པའི་མྱ་ངན་ལས་འདས་པའི་དབྱིངས་སུ་ཡོངས་སུ་མྱ་ངན་ལས་འདས་སོ།
en: “Later, the self-awakened ones thought, ‘Since we have attained what is to be attained with our putrid bodies, we will enter the realm of peaceful emancipation.’ They displayed miracles, namely, blazing fire, radiating light, and causing rain to fall and lightning to strike, and they were completely emancipated in the realm of emancipation without remainder.

source: །དེ་རྣམས་ལྡང་བའི་དུས་གང་ཡིན་པ་དེའི་ཚེ་མི་ལྡང་ནས་སྤྲེའུ་དེས་དེ་རྣམས་མ་མཐོང་བས་མི་དགའ་བར་གྱུར་ཏོ།
en: “They therefore did not rise at their usual hour of rising. When he did not see them, the monkey became anxious.

source: །ཇི་ཙམ་ན་སྤྲེའུ་དེ་ཕུག་ཏུ་ཞུགས་ནས་རང་སངས་རྒྱས་དེ་རྣམས་ཀྱི་ཆོས་གོས་རྣམས་ནས་གསིག་པར་བརྩམས་སོ།
en: The monkey entered the cave and shook their robes.

source: །དེ་ནས་ཕུག་དེ་ན་གནས་པའི་ལྷ་གང་ཡིན་པ་དེ་འདི་སྙམ་དུ་སེམས་ཏེ། སྤྲེའུ་འདིས་རང་སངས་རྒྱས་རྣམས་ཀྱི་སྐུ་བཤིག་ན་མི་རུང་ངོ་སྙམ་ནས་རྡོ་ལེབ་ཆེན་པོས་སྒོ་བཅད་ནས་འདུག་གོ།
en: Then a deity living in the cave thought, ‘If this monkey destroys the bodies of the self-awakened ones, that would not be appropriate.’ He shut the entrance with a large stone slab and stood there.

source: །དེ་ནས་སྤྲེའུ་དེ་མྱ་ངན་དང་སྡུག་བསྔལ་བ་དང་། སྨྲེ་སྔགས་བཏོན་ཏེ་སོང་ནས་རི་བོ་རྩེ་མཐོན་ལ་ཀུན་ནས་འཁྱམ་པ་ན་མི་རྣམས་འདོད་པས་མི་དགའ་བར་གྱུར་ཏེ།
en: The monkey felt sorrow and pain and lamentation, and so he departed and wandered on Mount Urumuṇḍa.

source: རྣ་བ་གཏོད་ཅིང་མིའི་སྒྲ་ཐོས་པར་འདོད་པ་ལས། དེས་དྲང་སྲོང་དེ་རྣམས་སྨྲ་བའི་སྒྲ་དག་ཐོས་ནས།
en: Anxious, and missing the humans, he strained his ears to hear a human voice, and soon he heard the voices spoken by those ṛṣis.

source: དེ་འགྲོན་པ་ལམ་སྟོར་བ་བཞིན་དུ་རིངས་པ་རིངས་པར་དེ་རྣམས་ཀྱི་དྲུང་དུ་སོང་ངོ་།
en: Just like a lost traveler, he hurried to them.

source: །དྲང་སྲོང་དེ་དག་ཀྱང་དཀའ་ཐུབ་དྲག་པོས་གདུང་བར་བྱེད་དེ།
en: “Those ṛṣis were harming themselves with horrible ascetic practices:

source: ཁ་ཅིག་ནི་ལག་པ་བསྒྲེང་ནས་འདུག་གོ། །ཁ་ཅིག་ནི་རྐང་པ་ཡ་གཅིག་གིས་སོ། །ཁ་ཅིག་ནི་གདུང་བ་ལྔས་གདུང་བར་བྱེད་དོ། །གང་གི་ཚེ་སྤྲེའུ་དེ་དེ་རྣམས་དང་ལྷན་ཅིག་བག་ཕེབས་པར་གནས་པར་གྱུར་པ་དེའི་ཚེ་དྲང་སྲོང་དེ་རྣམས་ལ་རྩ་བ་དང་། ལོ་མ་དང་། མེ་ཏོག་དང་། འབྲས་བུ་དང་། སོ་ཤིང་དག་སྦྱིན་པར་བྱེད་དོ།
en: some were keeping their hands raised, some were standing on one foot, and some were tormenting themselves with fivefold heat. When the monkey felt comfortable living with them, he offered them roots, leaves, flowers, fruits, and toothpicks.

source: །དེ་རྣམས་ཀྱང་དེ་ལ་ཟས་ཀྱི་ལྷག་མ་དག་འདོར་བར་བྱེད་དོ།
en: They, too, gave him their leftovers.

source: །དེས་དེ་རྣམས་ཀྱི་སྤྱོད་ལམ་དཀྲུགས་ཤིང་རང་སངས་རྒྱས་ཀྱི་སྤྱོད་ལམ་སྟོན་པར་བྱེད་དེ།
en: Disrupting their behavior, he taught them the behavior of the self-awakened ones:

source: །དེ་ན་གང་དག་ལག་པ་སྒྲེང་བ་དེ་རྣམས་ཀྱི་ལག་པ་དག་ཕབ་ནས་སེ་གོལ་གྱི་སྒྲ་ཕྱུང་སྟེ། སྦྲན་ནས་མདུན་དུ་སྐྱིལ་མོ་ཀྲུང་བཅས་ཏེ་འདུག་གོ།
en: there he lowered the hands of those who were keeping their hands raised, snapped his fingers, and sat down before them with his legs crossed;

source: །གང་དག་རྐང་པ་ཡ་གཅིག་པ་དེ་རྣམས་ཀྱི་རྐང་པ་ཕབ་ནས་མདུན་དུ་སྐྱིལ་མོ་ཀྲུང་བཅས་ཏེ་འདུག་གོ།
en: he lowered the legs of those who were standing on one foot and sat down before them with his legs crossed;

source: །གང་དག་གདུང་བ་ལྔས་གདུང་བར་བྱེད་པ་དེ་རྣམས་ཀྱི་མེ་གསད་ནས་སེ་གོལ་གྱི་སྒྲ་ཕྱུང་སྟེ་མདུན་དུ་སྐྱིལ་མོ་ཀྲུང་བཅས་ནས་འདུག་གོ།
en: and he put out the fires of those who were tormenting themselves with fivefold heat, snapped his fingers, and sat down before them with his legs crossed.

source: །དེ་ནས་དྲང་སྲོང་དེ་རྣམས་ཀྱིས་གདམས་ངག་འབོགས་པ་ལ་སྨྲས་པ། མཁན་པོ་སྤྲེའུ་འདི་བདག་ཅག་གི་དཀའ་ཐུབ་ལ་བར་ཆད་བགྱིད་དོ་ཞེས་དེ་རྣམས་ཀྱིས་དེ་ལ་རྒྱས་པར་སྨྲས་པ་དང་། དེས་སྨྲས་པ་ཤེས་ལྡན་དག་སྤྲེའུ་དེ་དག་ནི་དྲན་པ་དང་ལྡན་པ་ཡིན་ཏེ།
en: Then the ṛṣis said to their instructor, ‘Master, this monkey interrupts our ascetic practice,’ and they explained everything to him in detail. “ ‘Sirs,’ he replied, ‘these monkeys have good memories.

source: གདོན་མི་ཟ་བར་འདིས་དྲང་སྲོང་ཁ་ཅིག་གི་སྤྱོད་ལམ་དེ་ལྟ་བུ་མཐོང་གིས་ཁྱེད་ཅག་གིས་ཀྱང་སྐྱིལ་མོ་ཀྲུང་ཆོས་ལ་འདུག་ཤིག །དེ་རྣམས་ཀྱིས་སྐྱིལ་མོ་ཀྲུང་བཅས་ཏེ་འདུག་པ་དང་། དེ་རྣམས་ཀྱི་སྔོན་གྱི་དགེ་བའི་རྩ་བ་རྣམས་མངོན་དུ་གྱུར་ནས་དེ་རྣམས་ཀྱིས་མཁན་པོ་དང་སློབ་དཔོན་མེད་པའི་ཤེས་པས་བྱང་ཆུབ་ཀྱི་ཕྱོགས་སུམ་བཅུ་རྩ་བདུན་དང་མཐུན་པའི་ཆོས་བསྐྱེད་ནས་རང་བྱང་ཆུབ་མངོན་སུམ་དུ་བྱས་སོ།
en: Since he has certainly seen such behavior by some other ṛṣis, you should sit with your legs crossed, too.’ “When they sat with their legs crossed, their previous roots of merit became manifest. They generated the thirty-seven aspects of awakening with knowledge, without a teacher or preceptor, and actualized the awakening of self-awakened ones.

source: །དེ་ནས་དེ་རྣམས་སྤྲེའུ་དེ་ལ་ཆོས་ལས་བྱུང་བའི་དད་པ་སྐྱེས་ནས།
en: They directed the faith that had emerged from the Dharma to the monkey.

source: དེ་རྣམས་ཀྱིས་ལྗོངས་ནས་བསོད་སྙོམས་ལོ་ཏོག་སར་པ་དང་འབྲས་བུ་སར་པ་དང་། དུས་གསར་གྱི་རྙེད་པ་གང་ཡིན་པ་དེ་རྣམས་ལས་དེ་ལ་ཐོག་མར་བྱིན་ནས་བདག་ཉིད་ལོངས་སྤྱོད་པར་བྱེད་དོ།
en: Whenever they received fresh crops, fresh fruits, or seasonal foods as alms from people, they gave him some of the food first and after that enjoyed the rest of the food for themselves.

source: །ཇི་ཙམ་དུས་གཞན་ཞིག་ན་སྤྲེའུ་དེ་དུས་ལས་འདས་སོ།
en: “Later, the monkey died.

source: །དེ་ནས་རང་བྱང་ཆུབ་དེ་རྣམས་ཀྱིས་ཡུལ་ཁམས་དང་ཕྱོགས་སྣ་ཚོགས་ན་ཡོད་པའི་ཤིང་དྲི་ཞིམ་པོ་རྣམས་བླངས་ཏེ། ཤིང་དྲི་ཞིམ་པོ་ཐམས་ཅད་ཀྱིས་ཕུང་པོར་སྤུངས་ནས་བསྲེགས་སོ།
en: The self-awakened ones gathered fragrant wood from various areas and directions, heaped up all the fragrant wood, and cremated his body.

source: རང་བྱང་ཆུབ་རྣམས་དང་ལྷན་ཅིག་ཏུ་གནས་པའི་སྤྲེའུ་གང་ཡིན་པ་དེ་ནི་ཉེ་སྦས་འདི་ཉིད་ཡིན་ཏེ།
en: That monkey who lived with the self-awakened ones was indeed this Upagupta.

source: འདི་དེའི་ཚེ་ཡང་སྐྱེ་བོ་མང་པོ་ལ་ཕན་པའི་ཕྱིར་ཞུགས་སོ།
en: At that time, he acted for the benefit of many people.

source: །ད་ལྟར་ན་ཡང་ངས་འདི་སྐྱེ་བོ་མང་པོ་ལ་ཕན་པ་དང་སྙིང་རྗེ་བར་ལུང་བསྟན་ཏོ།
en: And now, too, I have predicted his benefiting and having compassion for many people.” C. The Brahmin Nīlabhūti

source: །དེ་ནས་བཅོམ་ལྡན་འདས་དཔའ་སྡེ་ནས་ལྗོངས་རྒྱུ་ཞིང་གཤེགས་པ་ན་བཅོམ་བརླག་ཏུ་གཤེགས་པ་དང་། བཅོམ་བརླག་གི་བྲམ་ཟེ་རྣམས་ཀྱིས་དགེ་སྦྱོང་གཽ་ཏ་མ་བཅོམ་བརླག་ཏུ་ཕྱིན་ནས་དེ་ཤིན་ཏུ་རིགས་བཞི་པོ་རྣམ་པར་དག་པར་འདོད་དེ་འཆད་པར་བྱེད་འདོགས་པར་བྱེད། རབ་ཏུ་འཇོག་པར་བྱེད། རྣམ་པར་འབྱེད་པར་བྱེད། བྱེ་བྲག་ཏུ་འབྱེད་པར་བྱེད། གསལ་བར་བྱེད།
en: Thereupon The Blessed One, traveling in Śūrasena, went to Mathurā. Some brahmins in Mathurā heard that the śramaṇa Gautama had arrived in Mathurā and that, with the strong wish to purify the four castes, he explained, designated, defined, analyzed, expounded, clarified, taught, and perfectly taught.

source: སྟོན་པར་བྱེད། ཡང་དག་པར་རབ་ཏུ་སྟོན་པར་བྱེད་དོ་ཞེས་ཐོས་ནས། གལ་ཏེ་དེ་བཅོམ་བརླག་ཏུ་འདུག་ན་བདག་ཅག་གི་རྙེད་པ་དང་བཀུར་སྟིའི་བར་ཆད་དུ་འགྱུར་ལ་དེ་ནི་བཀུར་སྟི་མ་ཡིན་པས་སྐྲག་གོ་ཞེས་གྲག་གིས།
en: They thought, “If he enters Mathurā, he will be an obstacle to us gaining profit and honors.

source: གལ་ཏེ་དེ་ལ་འགའ་ཞིག་གིས་བཀུར་སྟི་མ་ཡིན་པ་བྱས་ནས་དེ་ལྟ་ན་དེ་བཅོམ་བརླག་ཏུ་འདུག་པར་མི་འགྱུར་རོ།
en: Since it is known that he is concerned about disrespectful acts, if someone performs disrespectful acts toward him, he will not stay in Mathurā.

source: །གལ་ཏེ་དེ་ལ་མི་སྨད་རིགས་ཀྱིས་བཀུར་སྟི་མ་ཡིན་པ་བྱས་ན་ངོ་མཚར་དུ་མི་འཛིན་གྱི་གལ་ཏེ་དེ་ལ་སྐྱེས་བུ་གཙོ་བོ་འགའ་ཞིག་གིས་བཀུར་སྟི་མ་ཡིན་པ་བྱས་ན་དེས་ནི་ལེགས་པར་འགྱུར་ན།
en: It would not be surprising if someone from a lowly family performed disrespectful acts toward him, but it would be more effective if some great person did so.

source: བདག་ཅག་གི་ནང་ན་སྐྱེས་བུ་གཙོ་བོ་སུ་ཞིག་ཡོད་སྙམ་མོ།
en: Is there any great person among us?”

source: །དེའི་ཚེ་བཅོམ་བརླག་ན་བྲམ་ཟེ་སྔོར་གྱུར་ཅེས་བྱ་བ་རིག་བྱེད་དང་རིག་བྱེད་ཀྱི་ཡན་ལག་གི་ཕ་རོལ་ཏུ་ཕྱིན་པ་རང་གི་སྨྲ་བ་གསལ་བར་བྱེད་པ། ཕ་རོལ་གྱི་རྒོལ་བ་ཚར་གཅོད་པར་ནུས་པ་དེའི་ཚིག་བདེན་པའི་རྗེས་སུ་འབྲང་བ་ཞིག་ཡོད་དོ།
en: At that time there was a brahmin in Mathurā named Nīlabhūti, who had mastered the Vedas and the auxiliary branches of the Vedas, who was able to present his own words clearly and defeat others’ criticisms, and whose words followed the truth.

source: །དེ་ནས་བཅོམ་བརླག་གི་བྲམ་ཟེ་རྣམས་འདུས་ཤིང་ཚོགས་ཏེ། སྔོར་གྱུར་གྱི་དྲུང་དུ་སོང་ནས་མཁན་པོ་འདིར་དགེ་སྦྱོང་གཽ་ཏ་མ་མཆིས་ནས། དེར་ཤིན་ཏུ་རིགས་བཞི་པོ་རྣམ་པར་དག་པ་ཞེས་བྱ་བ་ནས་ཡང་དག་པར་རབ་ཏུ་སྟོན་པར་བྱེད་དོ་ཞེས་ཐོས་ཞེས་བྱ་བའི་བར་གོང་མ་བཞིན་དུའོ། །དེ་ནི་བཀུར་སྟི་མ་ཡིན་པས་སྐྲག་གོ་ཞེས་གདའ་ན།
en: Then the brahmins in Mathurā met together, flocked together, went to Nīlabhūti, and said, “Master, it has been heard that the śramaṇa Gautama has come here and that, with the strong wish to purify the four castes, he . . . perfectly teaches.

source: གལ་ཏེ་དེ་ལ་འགའ་ཞིག་གིས་བཀུར་སྟི་མ་ལགས་པ་བགྱིས་ན། དེ་ལྟ་ན་དེ་བཅོམ་བརླག་ཏུ་མཆིས་པར་མི་འགྱུར་རོ།
en: Since it is known that he is concerned about disrespectful acts, if someone performs disrespectful acts toward him, he will not stay in Mathurā.

source: །གལ་ཏེ་དེ་ལ་མི་སྨད་རིགས་ཀྱིས་བཀུར་སྟི་མ་ལགས་པ་བགྱིས་ན་ངོ་མཚར་དུ་མི་འཛིན་གྱི་གལ་ཏེ་དེ་ལ་སྐྱེས་བུ་གཙོ་བོ་འགའ་ཞིག་གིས་བཀུར་སྟི་མ་ལགས་པ་བགྱིས་ན་ལེགས་པར་འགྱུར་ན།
en: It would not be surprising if someone from a lowly family performed disrespectful acts toward him, but it would be more effective if some great person did so.

source: བདག་ཅག་གི་སྐྱེས་བུ་གཙོ་བོ་མཁན་པོ་མ་ལགས་པ་སུ་ཞིག་མཆིས།
en: Who else but you is the great person among us?

source: ཁྱོད་ཀྱིས་དེ་ལ་བཀུར་སྟི་མ་ལགས་པའི་ཚིག་གི་རྒྱ་ལྕག་གིས་སྤྱོ་བར་གསོལ།
en: Please revile him with disrespectful words of blame.”

source: སྔོར་གྱུར་གྱིས་སྨྲས་པ། ཤེས་ལྡན་དག་བདག་གི་ལྕེ་འདི་ནི་བདེན་པའི་རྗེས་སུ་འབྲང་བ་ཡིན་ཏེ།
en: “Sirs,” said Nīlabhūti, “this tongue of mine follows the truth.

source: གལ་ཏེ་སྤྱོ་བར་འོས་པ་ཞིག་ན་སྤྱོའོ།
en: If he deserves revilement, I will revile him.

source: །འོན་ཏེ་བསྟོད་པར་འོས་པ་ཞིག་ན་བསྟོད་དོ།
en: But if he deserves praise, I will praise him.”

source: །དེ་ནས་བྲམ་ཟེ་སྔོར་གྱུར་བཅོམ་བརླག་ན་གནས་པའི་བྲམ་ཟེ་རྒན་རབས་རྒན་རབས་རྣམས་ཀྱིས་མདུན་དུ་བདར་ནས་བཅོམ་ལྡན་འདས་གང་ན་བ་དེར་སོང་བ་ན།
en: After that, the brahmin Nīlabhūti, attended by the elder brahmins living in Mathurā, went to the Blessed One.

source: བྲམ་ཟེ་སྔོར་གྱུར་གྱིས་རྒྱང་རིང་པོ་ཁོ་ན་ནས་བཅོམ་ལྡན་འདས་སྐུ་སྐྱེས་བུ་ཆེན་པོའི་མཚན་སུམ་བཅུ་རྩ་གཉིས་ཀྱིས་ཀུན་ནས་བརྒྱན་པ། དཔེ་བྱད་བཟང་པོ་བརྒྱད་བཅུས་མཛེས་པར་བྱས་པ། འོད་འདོམ་གང་གིས་བརྒྱན་པ། འོད་ཟེར་ཉི་མ་སྟོང་བས་ལྷག་པ། རིན་པོ་ཆེའི་རི་བོ་འགྲོ་བ་ལྟར་ཀུན་ནས་བཟང་བ་ཤིང་དྲུང་ཞིག་ན་རྟེན་ཅིང་ཞི་བའི་སྤྱོད་ལམ་གྱིས་བཞུགས་པ་མཐོང་ངོ་།
en: The brahmin Nīlabhūti saw from a distance the Blessed One, whose body was fully ornamented with the thirty-two marks of a great man, illuminated by the eighty minor marks, ornamented with a fathom-wide halo, and beautiful like a moving mountain of jewels with light surpassing a thousand suns, sitting tranquilly under a tree.

source: །མཐོང་ནས་ཀྱང་ཡ་མཚན་སྐྱེས་ཏེ་མིག་བགྲད་དེ་བལྟས་ནས་བསྟོད་པར་བརྩམས་པ།
en: Upon seeing him, the brahmin opened his eyes wide with astonishment and began to praise the Blessed One:

source: ལུས་དང་ངག་དང་དབང་པོར་བཅས་པ་ཡི། །ཡིད་ཀྱིས་ཚུལ་བཞིན་རྩེ་གཅིག་བགྱིས་ནས་ནི།
en: “Having duly concentrated Body, speech, and mind along with the other faculties,

source: །ཡོན་ཏན་རང་བཞིན་ཡོན་ཏན་རྒྱ་མཚོ་ཆེ། །ཁྱོད་ཀྱི་ཡོན་ཏན་ཕྱོགས་གཅིག་བརྗོད་པར་བགྱི།
en: I will describe a mere fragment of the good qualities belonging to you, Who have become good quality itself, the ocean of good qualities.

source: །སྨྲ་བ་རྣམས་ཀྱི་དམ་པ་རབ་མཆོག་ལགས།
en: “You are the best, the most excellent, of those who speak,

source: །སྐྱོན་མེད་དབང་པོ་ཤིན་ཏུ་མཉམ་པར་བཞག །ཕ་རོལ་རྒོལ་བ་བརྩོན་པ་ཐམས་ཅད་ཀྱིས།
en: Free from fault, with your faculties well settled; All the opposing teachers contending with you

source: །དོན་དམ་ཐུགས་སུ་ཆུད་ལ་བསྐྱོད་མི་ནུས།
en: Cannot agitate you, who comprehend the highest truth.

source: །ཁྱོད་ཀྱི་སྤྱོད་པ་ཤིན་ཏུ་རྫོགས་པ་ཉིད།
en: “Your conduct is perfect

source: །བརྟུལ་ཞུགས་བསྒྲུབས་པས་བརྟུལ་ཞུགས་ཤིན་ཏུ་རྫོགས།
en: And your vow is well perfected and complete.

source: །སྟོབས་ལྡན་ཁྱོད་ཀྱི་ཏིང་འཛིན་ཟད་མེད་པས།
en: And, O Powerful One, your meditation’s inexhaustibility is just like

source: །སྲེད་མེད་བུ་དང་རི་ཡི་རྒྱལ་པོ་བཞིན།
en: That of Nārāyaṇa and the king of mountains.

source: །སྐྱེས་བུ་ཁྱུ་མཆོག་ཁྱོད་ལ་གནོད་མི་མངའ།
en: “O bull among men, you possess neither anguish,

source: །མི་ཞུམ་བསྙེངས་པ་མི་མངའ་དུབ་མི་མངའ།
en: Dejection, fear, nor fatigue.

source: །འབྱུང་པོ་རྣམས་ལའང་མི་བཟོད་འགའ་མི་མངའ།
en: Possessing no impatience with beings,

source: །ཁྱོད་ནི་མ་ཆགས་འཐབ་པ་ག་ལ་མངའ།
en: You are not attached to them, nor do you quarrel with anyone.

source: །བརྟབས་པ་མེད་ཅིང་ཧ་ཅང་ཞུམ་མི་མངའ།
en: “There is no apprehension, and yet you experience no excessive discouragement.

source: །གདུང་བ་མེད་ཅིང་དགྱེས་པའང་ཡོང་མི་མངའ།
en: There is no pain, and yet you have no delight.

source: །རི་ཡི་བདག་པོ་ལྷུན་པོ་རབ་བརྟན་ལྟར།
en: Just like Mount Meru, the king of mountains,

source: །ཁྱོད་ཀྱི་ཐུགས་ནི་རྟག་ཏུ་དགེ་བ་ཉིད།
en: Your mind is always good.

source: །ཐུབ་པ་སྐྱེས་མཆོག་ཁམས་རྣམས་ཐམས་ཅད་ནས།
en: “O best of munis, in every domain

source: །ཁྱོད་ཀྱི་ཡེ་ཤེས་ཡངས་པ་སྒྲིབ་མི་མངའ།
en: Your knowledge is extensive and free from obstacles,

source: །སྐྱེ་མཆེད་རྣམ་པ་སྣ་ཚོགས་དག་ལ་ནི།
en: And it engages various objects,

source: །མ་ཐོགས་ཉམས་ཤིང་ཟད་པ་མེད་པར་འཇུག །ཐུབ་པ་ཁྱོད་ལ་གང་ལའང་སོམ་ཉི་མེད།
en: Unhindered, unwaning, inexhaustible.

source: །ཡིད་གཉིས་ཡོད་མིན་ཐེ་ཚོམ་ཡོད་མ་ཡིན། །ཁྱོད་ཉིད་ཀྱིས་ནི་མཆོག་དང་མཆོག་མིན་པ།
en: “O Muni, for you there is no doubt, Hesitancy, or uncertainty about anything;

source: །རིག་པས་ཐུགས་སུ་ཆུད་ནས་ཐམས་ཅད་མཁྱེན།
en: Comprehending with knowledge The greater and lesser capacities of beings, you know everything.

source: །མཐོང་ན་དགའ་བར་འགྱུར་ལ་མཐོང་ན་ལེགས།
en: “You are pleasant to behold, good to behold;

source: །མཐོང་ན་ལེགས་པས་མཐོང་ན་མཁས་པ་དགའ།
en: Since you are good to behold, wise men are pleased to behold you.

source: །ཁྱོད་ལ་དགའ་དང་མི་དགའ་མཉམ་པས་ན།
en: Since what is pleasant and what is unpleasant are the same to you,

source: །རྟག་ཏུ་དགའ་བའི་སྤྱོད་ལམ་དེ་བཞིན་མཛད།
en: You always behave in a pleasant manner.

source: །ཁྱོད་ནི་སྙན་པའི་སྤོབས་པར་ལྡན་པ་ལགས།
en: “You possess a sweet eloquence,

source: །འཛུམ་པའི་གསུང་དང་དྲན་ལྡན་བསྙེངས་པ་མེད།
en: Speak with a smile with mindfulness, without fear.

source: །མཁས་རྣམས་འདོད་པ་རབ་ཏུ་འཆད་པས་ན།
en: Since you articulate what wise men love,

source: །འཇིག་རྟེན་གསུམ་དུ་ཁྱོད་ཀྱི་གྲགས་པ་འབྱུང་།
en: Your fame has spread throughout the three realms.

source: །མི་དང་ལྷ་དང་ལྷ་མིན་གནོད་སྦྱིན་དང་། །སྲིན་པོ་མང་དང་འཇིག་རྟེན་འདིར་མཁས་དག །ཐུབ་པའི་དྲུང་དུ་ཡང་དང་ཡང་ལྷགས་ནས།
en: “Many humans, gods, asuras, yakṣas, Rākṣasas, and wise men in this world Come to the Muni again and again,

source: །ཁྱོད་ལ་ཡང་དང་ཡང་ཞུ་མི་བཟོད་མེད།
en: And ask you questions again and again, but you do not become angry.

source: །ཁྱོད་ནི་སྙན་པའི་གསུང་གིས་དགའ་མཛད་པས།
en: “Since you please them with sweet words,

source: །མི་དང་ལྷ་དང་ལྷ་མིན་གནོད་སྦྱིན་དང་། །སྲིན་པོ་ཡིད་གཉིས་བསལ་རྣམས་ཐུབ་པ་ཆེ།
en: Humans, gods, asuras, yakṣas, And rākṣasas who have become free from hesitancy, O Great Muni,

source: །ཁྱོད་ཀྱི་ཞབས་ལ་ཕྱག་འཚལ་སླར་མཆིའོ།
en: Pay homage at your feet and return.

source: །བཞེངས་དང་བཞུགས་དང་གཤེགས་དང་བཞུད་པ་དང་། །མནལ་དང་མི་གསུང་ཡང་ན་གསུང་བའམ།
en: “Your standing, sitting, coming, going, Lying, being silent, speaking,

source: །འོན་ཏེ་ལྷུང་བཟེད་ཆོས་གོས་བསྣམས་པ་དག །གཽ་ཏམ་ཁྱོད་ཀྱི་ཐམས་ཅད་མཛེས་པ་ཉིད།
en: And holding your bowl and your robe— O Gautama, everything of yours is beautiful.

source: །ཐོགས་པ་མེད་མངའ་མི་མྱུར་མཉམ་པས་ན།
en: “Since you experience neither obstacles nor haste and are even,

source: །གསུང་ནི་སྙན་པའི་ཡོན་ཏན་རྣམས་དང་ལྡན།
en: Your words possess the good qualities of sweetness.

source: །མི་ཡི་མཆོག་ནི་དུས་སུ་གསུང་བས་ན།
en: Since you, the best of humans, speak at the appropriate time,

source: །གསུང་གི་ཟློས་པ་རྣམ་པར་སྤངས་པ་ལགས།
en: Your words are free from redundancy.

source: །འཇིག་རྟེན་ན་ནི་སྟོབས་དང་ལྡན་པར་གྲགས།
en: “You are renowned as one who possesses power in the world,

source: །སྐྱེས་བུ་མཁྱེན་པ་སྐྱེས་བུ་ཁྱུ་མཆོག་གཙོ།
en: Who knows humans, bull among men, lord;

source: །འཇིག་རྟེན་ལྷར་བཅས་འདི་ནི་མཐའ་དག་ལ།
en: Toward this entire world including its gods

source: །ང་རྒྱལ་མི་མངའ་ཁྱད་དུ་གསོད་མི་མཛད།
en: You are not haughty, nor do you despise anyone. “With friends and enemies,
